<template>
  <div>
    <el-row style="padding-left: 30px;padding-right: 30px">
      <!--<search-bar></search-bar>-->
      <el-col span="8"
              v-for="item in books"
              :key="item.id">
        <el-tooltip effect="dark" placement="top"
        >
          <p slot="content" style="width: 400px;font-size: 14px;margin-bottom: 6px;">{{ item.title }}</p>
          <p slot="content" style="width: 400px;font-size: 13px;margin-bottom: 6px">
            <span>{{ item.author }}</span> /
            <span>{{ item.date }}</span> /
            <span>{{ item.press }}</span>
          </p>
          <p slot="content" style="width: 400px" class="abstract">{{ item.abs }}</p>
          <el-row>
            <el-card
              style="margin-bottom: 20px;height: 240px;float: left;margin-right: 15px;width:98%;"
              class="book"
              bodyStyle="padding:10px" shadow="hover">
              <el-col span="10">
                <img :src="item.cover" alt="封面">
              </el-col>
              <el-col span="14" style="padding-left: 30px">
                <p class="book-title"><a href="">{{ item.title }}</a></p>
                <p class="author">作者:{{ item.author }}</p>
                <p class="author">时间:{{item.date}}</p>
                <p class="author">字数:{{item.size}}万字</p>
              </el-col>
            </el-card>
          </el-row>
        </el-tooltip>
      </el-col>
    </el-row>
    <!--    分页-->
    <el-row>
      <el-pagination
        :current-page="1"
        :page-size="10"
        :total="20">
      </el-pagination>
    </el-row>
  </div>
</template>

<script>
export default {
  name: 'Books',
  data () {
    return {
      books: [
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        },
        {
          cover: 'https://i.loli.net/2019/04/10/5cada7e73d601.jpg',
          title: '三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体三体',
          author: '刘慈欣',
          date: '2019-05-05',
          size: 123.4,
          press: '重庆出版社',
          abs: '文化大革命如火如荼进行的同时。军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但在按下发射键的那一刻，历经劫难的叶文洁没有意识到，她彻底改变了人类的命运。地球文明向宇宙发出的第一声啼鸣，以太阳为中心，以光速向宇宙深处飞驰……'
        }
      ]
    }
  }
}
</script>

<style scoped>

img {
  width: 100%;
  height: 220px;
  /*margin: 0 auto;*/
}

.book-title{
  font-size: 18px;
  padding-bottom: 5px;
  border-bottom: 1px solid #f0f0f0;
  overflow: hidden;
  white-space: nowrap;
  text-overflow: ellipsis;
}
.author {
  color: #9e9e9e;
  font-size: 14px;
  margin-bottom: 30px;
}

.abstract {
  display: block;
  line-height: 17px;
}

a {
  text-decoration: none;
}

a:link, a:visited, a:focus {
  color: #3377aa;
}
</style>
